#include <iostream>
#include <conio.h>
#include <malloc.h>

int main()
{
	///////////////////////////////////////////////////////////задание 1 начало
	int mass[10] = { 1,2,3,4,5,6,7,8,9,10 }, res;
	res = mass[sizeof(mass) / 4 - 1] - mass[0];
	printf("mass[%d] - mass[0] = %d", sizeof(mass) / 4 - 1, res);
	///////////////////////////////////////////////////////////задание 1 конец
	printf("\n-------------------------------------------\n");
	///////////////////////////////////////////////////////////задание 2 начало
	for (int i = 0; i < sizeof(mass) / 4; i++)
	{
		mass[i] = rand() % 41 - 10;
		printf("mass[%2d] = %d\n", i, mass[i]);
	}
	///////////////////////////////////////////////////////////задание 2 конец
	printf("-------------------------------------------\n");
	///////////////////////////////////////////////////////////задание 3 начало
	int** mass3;
	int size;
	printf("size = ");
	scanf_s("%d", &size);
	mass3 = (int**)malloc(size * sizeof(int*));
	for (int i = 0; i < size; i++) { mass3[i] = (int*)malloc(size * 4); }
	for (int i = 0; i < size; i++)
	{
		for (int j = 0; j < size; j++)
		{
			mass3[i][j] = rand() % 41 - 10;
			printf("%d ", mass3[i][j]);
		}
		printf("\n");
	}
	///////////////////////////////////////////////////////////задание 3 конец
	scanf_s("%d", &size);
	printf("-------------------------------------------\n");
	///////////////////////////////////////////////////////////задание 4 начало
	int mass4[10][3];
	for (int i = 0; i < 10; i++)
	{
		for (int j = 0; j < 3; j++)
		{
			mass4[i][j] = rand() % 20;
		}
		printf("%d+%d+%d=%d\n\n", mass4[i][0], mass4[i][1], mass4[i][2], mass4[i][0] + mass4[i][1] + mass4[i][2]);
	}
	///////////////////////////////////////////////////////////задание 4 конец
}